# 题目：639.解码方法 II
# 难度：HARD
# 最后提交：2023-01-04 22:00:44 +0800 CST
# 语言：python3
# 作者：ZrjaK

ONE = {'1': 1, '2': 1, '3': 1, '4': 1, '5': 1, '6': 1, '7': 1, '8': 1, '9': 1, '*': 9}
TWO = {'10': 1, '11': 1, '12': 1, '13': 1, '14': 1, '15': 1, '16': 1, '17': 1, '18': 1, '19': 1, '20': 1,
        '21': 1, '22': 1, '23': 1, '24': 1, '25': 1, '26': 1, '*0': 2, '*1': 2, '*2': 2, '*3': 2, '*4': 2,
        '*5': 2, '*6': 2, '*7': 1, '*8': 1, '*9': 1, '1*': 9, '2*': 6, '**': 15}
MOD = 10**9 +7
class Solution:
    def numDecodings(self, s: str) -> int:
        @lru_cache(None)
        def dfs(i):
            if i == n:
                return 1
            return (ONE.get(s[i], 0) * dfs(i + 1) % MOD + (0 if i == n - 1 else TWO.get(s[i:i+2], 0) * dfs(i + 2)) % MOD)% MOD

        n = len(s)
        return dfs(0)